{
    "teamwork": [
        "Tell me about the last time you worked as part of a team.",
        "Describe a time when you worked in a really effective team.",
        "Give me a specific example of when you have encouraged a cooperative approach in a team.",
        "When have your personal objectives been at odds with those of the team?",
        "Give me an example of when you had to support other in a team.",
        "Tell me about a time when you have accepted joint responsibility for a team’s limitations or problems.",
        "Describe an occasion when you had difficulties working with a team."
    ],
    "communication": [
        "Give me an example of when you had to explain something difficult to someone who did not have your background/knowledge.",
        "How would other people describe your communication skills?",
        "Tell me about a time when it was important to involve someone in a conversation.",
        "What kind of correspondence have you had to prepare in the past?",
        "What experience have you had speaking formally in front of others?",
        "Tell me about a time when you have chosen not to disclose information to others.",
        "Tell me about a time when you have outlined the key points in an argument in the past.",
        "Give me an example of a situation when it was important for you to communicate a strategy or organizational objective clearly to others."
    ],
    "planning and organizing": [
        "Describe the last time you missed a deadline.",
        "Describe an occasion when you had to prepare in advance for meeting or project.",
        "Give me an example of when you had to work to an important deadline.",
        "Describe the last time you missed a deadline.",
        "Tell me about the last project plan you had to produce piece of work or event you had to organize.",
        "Describe a recent situation where you had to set clearly defined objectives.",
        "Using a recent example, describe how you have developed actions for achieving an objective.",
        "Tell me about a time when it was necessary for you to plan several alternative courses of action in response to a change in an organization’s direction.",
        "Tell me about a time when you have had to translate a strategy into actions and plans.",
        "When have you considered strategic issues when developing goals?",
        "Tell me how you personally organize yourself when you have a lot of work."
    ],
    "integrity": [
        "Tell me about the last time that you were faced with a professional or ethical dilemma at work (in the recent past).",
        "When have you been asked to ‘bend the rules’ by a colleague or client?",
        "Describe a time when you have had to choose between admitting a mistake and maintaining credibility to a superior or client.",
        "Tell me about a time you have observed others working in an unprofessional or unethical manner.",
        "In most organizations there are rules, regulations and principles that have to be adhered to and some that can be interpreted more flexibly. Give me an example of a time where you have interpreted the rules with more flexibility.",
        "Give me an example of when you have had to defend an organization’s decision to others who did not agree with the viewpoint."
    ],
    "professionalism": [
        "Give me an example of when it has been important for you to appear knowledgeable about your area of specialty.",
        "Give me an example of when you have experienced a setback",
        "How do you define success in your current role/previous work?",
        "Give me an example of when you have set yourself an ambitious target",
        "Tell me about a time when you worked especially hard in your current role/work"
    ],
    "respect for diversity": [
        "What experience have you had with working with people from diverse backgrounds?",
        "Describe an occasion when you found it difficult to work with someone from a different background.",
        "Describe a situation that required you to consider a different perspective from your own when exploring an issue.",
        "Give me an example of a situation where you have pursued a course of action which had to take into account the sensitivities of external (different) parties.",
        "What opportunity have you had to examine your own biases and behaviours when dealing with people?",
        "When you are liaising with colleagues or others from different cultures, what sorts of issues do you need to take into account?"
    ],
    "accountability": [
        "Give me an example of when it has been particularly important for you to produce high-quality work.",
        "Give me an example of when time pressures prevented you from spending a lot of time on a task.",
        "Describe a time when you did not meet your usual standards of work.",
        "Describe a time when you failed to complete a task on time.",
        "Describe a time when you delegated a task to another person.",
        "What kinds of regulations or procedures do you have to respect at the moment?",
        "Tell me about a time when it was particularly important for you to take responsibility for your actions.",
        "When, on reflection, were you conscious that your team’s results/output could have been better?"
    ],
    "creativity": [
        "Tell me about a time when you came up with a new idea at work.",
        "Creative ideas may initially seem good but in practice be unusable. How often do you find this?",
        "Give me an example of a time when you used a less conventional approach to your work.",
        "In what situations are you least creative?",
        "Describe a situation when you produced an limaginative solution to a problem at work.",
        "Tell me about a time when you questioned a way of working.",
        "Tell me about a time when you took a risk with pursuing a new approach or idea.",
        "What feedback did you receive regarding the quality of your idea?"
    ],
    "client orientation": [
        "How much experience have you had with clients?",
        "Give me an example of when you have put a client first.",
        "Describe a time in the last 6 months when you had to help a client.",
        "Tell me about the last time a client made an excessive or unreasonable demand on you.",
        "Describe a time when you were unable to help out a client as much as they wanted.",
        "How much opportunity have you had to develop long-term relationships with clients?",
        "Give me an example of when it has been important to keep clients (people) informed of progress.",
        "When have you considered the perspective of clients when making a decision?"
    ],
    "continuous learning": [
        "What type of specialist knowledge have you needed to be aware of in your previous jobs/education?",
        "Which areas in your profession/occupation are the most challenging for you?",
        "Describe an occasion when colleagues (others) sought your advice or experience.",
        "How do you keep up with advances in your field?",
        "Describe an occasion when you felt that your level of technical knowledge was insufficient.",
        "How have you contributed to the learning of others?",
        "Describe an example of when you had to acquire additional technical knowledge."
    ],
    "technological awareness": [
        "How do you keep up with advances in technology?",
        "Which technical issues are the most challenging for you?",
        "Give me an example of when your technological awareness helped you to solve a problem.",
        "What have you done to acquire knowledge about technology?",
        "Give me an example of when technology breakdown had an impact on your delivery."
    ],
    "leadership": [
        "What opportunities have you had to take the lead in a team?",
        "Describe a specific example of a time when you had to coordinate the work of other people.",
        "Describe a time when you needed to take action to increase team motivation.",
        "Tell me about a particular situation where you had to lead by example.",
        "Tell me about a situation when you found it difficult to manage the work of a team.",
        "Tell me about a situation when you have had to keep a team focused on objectives.",
        "Describe an example where you have had to take charge and organize resources in your work.",
        "Describe an example of how you typically interact with staff at different levels of an organization.",
        "Describe how you have gone about resolving conflict between others in the past, using a specific example.",
        "For most of us the occasion arises when we must take an unpopular stand or decision. Give me an example of when you had to take an unpopular stand."
    ],
    "vision": [
        "Tell me about a recent time when you needed to take a broad view of your own work.",
        "Describe an occasion when you considered a range of possible future scenarios when planning.",
        "Give me an example of a time when you could have taken a more long-term view.",
        "Tell me about a time when you have had to translate a strategy into actions and plans.",
        "Tell me about a time when you have found it difficult to compel others to follow a strategic direction.",
        "Describe an example of when you have taken strategic implications into consideration as part of your decision-making.",
        "Tell me about a time when you have taken into account the wider implications of an issue in your decision-making.",
        "It is not always easy to step back from day-to-day operations to consider the bigger picture when making decisions. Give me an example of when you have found it difficult to consider the bigger picture when making a decision.",
        "Tell me about a situation when you took global trends into account in a strategy or plan."
    ],
    "empowering others": [
        "Describe a time when you successfully empowered someone to carry out a task.",
        "Tell me about how you have set goals for a team member in the past.",
        "Describe a specific example of when you have involved others when making decisions.",
        "Give me an example of when you have solicited the contributions of others in your team.",
        "Thinking of a specific example, how do you typically go about delegating tasks to others?",
        "How do you typically reward team members for their efforts?",
        "Describe a time when, in hindsight, you could see that you provided more detailed direction on an assignment than was necessary for the person involved.",
        "Thinking of a specific example, how do you normally go about providing others with the power and authority to accomplish a task?"
    ],
    "building trust": [
        "Give me an example of how you have developed and maintained trust in the past.",
        "Describe a time when others have been surprised about your reaction/approach to a management issue?",
        "When have you chosen to keep sensitive information to yourself?",
        "Tell me about a person with whom you worked that you found difficult to trust.",
        "Tell me about the last time that you had to trust a new team member to do a task.",
        "Describe a time when you have been unable to deliver on an agreed action."
    ],
    "managing performance": [
        "Tell me about a situation where you have had to manage the performance of a team or individual through a particular assii",
        "Tell me about a time when a member of your team made a mistake.",
        "What opportunities have you had to identify development opportunities for others?",
        "Describe an example of how you have utilize of others in the past.",
        "Tell me about a project in which you had to monitor people’s performance.",
        "How do you assess the capabilities of people (e.g., direct reports, applicants)?",
        "What opportunities have you had to assess other people’s performance?",
        "Describe a development plan that you have set for a team member."
    ],
    "decision making": [
        "Describe to me a complex problem which you recently solved.",
        "Tell me about when you have had to identify the key cause of a problem.",
        "Give me a recent example of when you came up with different solutions to a problem.",
        "Tell me about a time when you made the wrong decision when solving a major problem.",
        "Give me an example of the type of information sources you typically use in an attempt to get to the bottom of issues.",
        "Give me an example of the type of questions you have asked in order to establish the facts about a past situation or problem.",
        "Describe the last time that you had to analyse a large amount of information to solve a problem.",
        "Describe a situation where you have had to consider a variety of alternatives in your decision-making.",
        "Describe the process that you typically use to make a final decision.",
        "Tell me about a time when you found it particularly tough to make a decision?"
    ]
}
